Revit 2026 API

# ElectricalSystemOtherConductorsNumber Property

---

The OtherConductors Number of the Electrical System.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int OtherConductorsNumber { get; }
```
```vb
Public ReadOnly Property OtherConductorsNumber As Integer
	Get
```
```cpp
public:
property int OtherConductorsNumber {
	int get ();
}
```
```fsharp
member OtherConductorsNumber : int with get
```

#### Property Value

Int32

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This property only available when System Type is Power! |

This property is used to retrieve the OtherConductors Number of the Electrical System.

#### Reference

ElectricalSystem Class

Autodesk.Revit.DB.Electrical Namespace